
/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CurrFliterCalc.h
** @Founder      : 
** @Date         :
** @Function     : 
** @Instructions :
**===========================================================================================*/
#ifndef _CURRFILTERCLAC_H
#define _CURRFILTERCLAC_H
/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPTypeDef.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/

typedef struct {
    float32 f32MinVal;               // 当前5个数据中的最小值
    float32 f32MaxVal;           // 当前5个数据中的最大值
    float32 f32InputVal[10U]; // 存储采样值的缓冲区
    uint8 u8InputCount;      // 当前已采集的数据个数
} St_FilterType;


/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : bool GetFilterValue(float32 f32Input, float32 *pf32Output, St_FilterType *pstFilter)
** @Input     : 
** @Output    : 引用返回pf32Output
** @Function  : 去极值平均滤波(去掉最大值和最小值后取平均)
** @The notes : 
**===========================================================================================*/   
bool GetFilterValue(float32 f32Input, float32 *pf32Output, St_FilterType *pstFilter);
bool IsCoefValid(float32 f32K, float32 f32B);
#endif