/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : SystemInfo.c
** @Founder      : WYC834
** @Date         : 2025.11.3
** @Function     : 自身参数模块
** @Instructions : 系统自身所有参数
**===========================================================================================*/

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "SystemInfo.h"
#include "BSPDIDO.h"
/*=============================================================================================
** @Global variable definition
**===========================================================================================*/

u8 gHardVersion = 0;
/*=======================================校时信息=================================================*/
u16 SystemTime_0[SystemTime_len] =
{
    2026,                           /*系统时间-年*/
    0x0101,                         /*系统时间-月/日*/
    0x0,                            /*系统时间-时/分*/
    0x0                             /*系统时间-毫秒*/
};
/*=======================================系统信息=================================================*/
u16 SystemInfo_1[DeviceInfo1_len] = 
{
    DIVICE_MARK,                          /*设备识别码*/
    DIVICE_ADDR,                          /*设备地址*/
    HARDWARE_VERSION,                     /*硬件版本号*/
    SOFTWARE_VERSIONL,                    /*软件支线版本号*/
    SOFTWARE_VERSIONH ,                   /*软件主线版本号*/
    BSP_VERSION,                          /*BSP版本号*/
    CAN_LIB_VERSION,                      /*CAN协议包版本号*/
    UART_LIB_VERSION                      /*USAT协议包版本号*/
};//系统信息

// fot systemtest
// u16 SystemWorkState_50[WorkMode_Len];
u16 SystemWorkState_50[WorkMode_Len]=
{
    eMODE_Normal
};
/*=============================================================================================
** @Static function declaration
**===========================================================================================*/

/*=============================================================================================
** @Interface function definition
**===========================================================================================*/
void InitSystemInfo(void)
{
    SystemInfo_1[DeviceAddr] = SWReadData()+20;//本设备地址读取
}

/*=============================================================================================
** @Name      : void InPutSystemInfoArray (u8 index ,u16 data);
** @Input     : index:系统数据下标 data:数据
** @Output    : void
** @Function  : 输入系统数据
** @The notes :
**===========================================================================================*/
void InPutSystemInfoArray (u8 index ,u16 data)
{
    if (index > DeviceInfo1_len)
    {
        return;
    }
    SystemInfo_1[index] = data;
}


/*=============================================================================================
** @Name      : u16 GetSystemInfoArray (u8 index);
** @Input     : index:系统数据下标
** @Output    : 系统数据
** @Function  : 获取系统数据
** @The notes :
**===========================================================================================*/
u16 GetSystemInfoArray (u8 index)
{
    return SystemInfo_1[index];
}

/*=============================================================================================
** @Name      : u16 GetSystemWorkModeArray (u8 index);
** @Input     : index:系统工作模式信息下标
** @Output    : 系统权限信息
** @Function  : 获取系统工作模式信息
** @The notes :
**===========================================================================================*/
u16 GetSystemWorkModeArray (u8 index)
{
    return SystemWorkState_50[index];
}

/*=============================================================================================
** @Name      : void InPutSystemWorkModeArray (u8 index ,u16 data);
** @Input     : index:系统工作模式信息下标 data:数据
** @Output    : void
** @Function  : 输入系统工作模式信息
** @The notes :
**===========================================================================================*/
void InPutSystemWorkModeArray (u8 index ,u16 data)
{
    if (index >= WorkMode_Len)
    {
        return;
    }
    
    SystemWorkState_50[index] = data;
}

/*=============================================================================================
** @Static function definition
**===========================================================================================*/
