/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : BSPConfig.c
** @Founder      : WYC834
** @Date         : 2025.8.15
** @Function     : 各驱动模块初始化接口
** @Instructions :
**===========================================================================================*/
#ifndef _BSPUSERCFG_H
#define _BSPUSERCFG_H

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
/*=======================================各个模块使能配置=====================================*/
#define CAN1_FUN_EN     1           /*CAN1模块使能                      1使能该模块  0禁止该模块*/
#define USART6_FUN_EN   1           /*USART6使能                        1使能该模块  0禁止该模块*/
#define SPI1_FUN_EN     1           /*SPI_1使能                         1使能该模块  0禁止该模块*/
#define SPI3_FUN_EN     1           /*SPI_3使能                         1使能该模块  0禁止该模块*/
#define IIC2_FUN_EN     1           /*IIC模块使能                       1使能该模块  0禁止该模块*/
#define FLASH_FUN_EN    1           /*FALSH模块使能                     1使能该模块  0禁止该模块*/
#define ADC_FUN_EN      1           /*ADC采样模块使能                   1使能该模块  0禁止该模块*/
#define DMA_FUN_EN      1           /*DMA模块使能                       1使能该模块  0禁止该模块*/
#define TIM6_FUN_EN     1           /*TIM6模块使能                      1使能该模块  0禁止该模块*/
#define TIM7_FUN_EN     1           /*TIM6模块使能                      1使能该模块  0禁止该模块*/
#define GPIO_FUN_EN     1           /*GPIO模块使能                      1使能该模块  0禁止该模块*/
#define DIDO_FUN_EN     1           /*DIDO模块使能                      1使能该模块  0禁止该模块*/
#define DEBUG_EN        0           /*RTT打印以及调试使能               1使能该模块  0禁止该模块*/
#define CHANGE_RATE_EN  0           /*可调波特率模块使能                1使能该模块  0禁止该模块*/
#define WDOG_FUN_EN     0           /*内部看门狗模块使能                1使能该模块  0禁止该模块*/

/*=======================================USART begin===========================================*/

#define USART6_BPS      (9600)     	/*只能是4800 9600 19200 38400*/
/*=======================================SCI end=============================================*/

/*=======================================SPI begin===========================================*/
#define SPI1_BPS        (1000)         /*SPI1通讯波特率 只能为 500 1000 2000 4000(单位为K)*/
#define SPI3_BPS        (1000)         /*SPI2通讯波特率 只能为 500 1000 2000 4000(单位为K)*/
/*=======================================SPI end=============================================*/

/*=======================================CAN begin===========================================*/
#define CAN1_BPS        500         /*只能为 125 250 500 1000(单位为K)*/

/*=======================================CAN end=============================================*/


/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPTypeDef.h"



#if DEBUG_EN
#include "SEGGER_RTT.h"
#endif
/*=============================================================================================
** @Data type definition
**===========================================================================================*/
/*各功能模块使能配置转化为参数结构体*/
typedef union _FunConfig_
{
    u32 Word;
    struct
    {
    u16 CAN1En      :1;         /*CAN功能使能*/
    u16 USART6En    :1;         /*USART功能使能位*/
    u16 SPI1En      :1;         /*SPI1功能使能位*/   
    u16 SPI3En      :1;         /*SPI3功能使能位*/  
    u16 IIC2En       :1;         /*IIC功能使能位*/  
    u16 FLASHEn     :1;         /*内部FLASH功能使能*/
    u16 ADCEn       :1;         /*AD采样功能使能位*/      
    u16 WDOGEn      :1;         /*内部喂狗功能使能位*/
    u16 DMAEn       :1;         /*DMA功能使能位,不使能DMA,无法使用DMA硬件通信*/
    u16 TIM6En      :1;         /*TIM6定时器功能使能*/
    u16 TIM7En      :1;         /*TIM7定时器功能使能*/
    u16 DIDOEn      :1;         /*DIDO功能使能位,使能DIDO之前必须使能GPIO*/
    u16 GPIOEn      :1;         /*GPIO功能使能位*/
    }Bits;
}u_BSPFunCfg;

/*各功能模块参数*/
typedef struct
{
    u16 Can1Rate;                   /*CAN1通信波特率(1kbps)*/
    u16 Usart6Rate;                 /*USART6通信波特率(1bps)*/
    u16 Spi1Rate;                   /*SPI1通信波特率(1Mbps)*/
    u16 Spi3Rate;                   /*SPI3通信波特率(1Mbps)*/                
} s_BSPParaCfg;
extern volatile u_BSPFunCfg gBSPFunCfg;
extern volatile s_BSPParaCfg gBSPParaCfg;
/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/
/*=============================================================================================
** @Name      : void BSPUserCfgInit(void)
** @Input     : void
** @Output    : void
** @Function  : BSP驱动功能用户配置模块参数初始化
** @The notes : Main()函数调用，上电初始化
**===========================================================================================*/
void BSPUserCfgInit(void);

/*=============================================================================================
** @Name      : void BSPDriverInit(void)
** @Input     : void
** @Output    : void
** @Function  : 所有底层驱动模块进行初始化
** @The notes : Main()函数调用，上电初始化
**===========================================================================================*/
void BSPDriverInit(void);

/*=============================================================================================
** @Name      : void DEVDriverInit(void)
** @Input     : void
** @Output    : void
** @Function  : 所有外围设备驱动模块进行初始化
** @The notes : Main()函数调用，上电初始化。必须在底层驱动初始化完成后调用
**===========================================================================================*/
void DEVDriverInit(void);

#endif
