/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : SystemData.h
** @Founder      : WYC834
** @Date         : 2025.10.21
** @Function     : 系统数据模块
** @Instructions : 系统自身所有信息
**===========================================================================================*/
#ifndef _SYSTEMDATA_H
#define _SYSTEMDATA_H
/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPTypeDef.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/

/*=============================================================================================
** @Data type definition
**===========================================================================================*/
typedef struct tagMeasureData
{
    u8 u8DiState;     //1路DI状态
    u8 u8DoState[2];  //两路DO状态
    u8 u8SwAddr;

    //高精度数据，用于计算
    f32 fNtcTemp[2];   //两路ntc温度
    f32 fBatShuntTemp;    //分流器温度

    f32 fBatVolt;  //电池电压
    f32 fAdjustBatVolt;  //电池校准电压

    f32 fBatShuntVolt;                  //电池分流器电压
    f32 fAdjustBatShuntVolt;            //电池分流器校准电压

    f32 fBatShuntCurrent;               //电池分流器电流
    f32 fAdjustBatShuntCurrent;         //电池分流器校准电流

    f32 fBatShuntVoltBackup;            //电池分流器备份电压
    f32 fAdjustBatShuntVoltBackup;      //电池分流器备份校准电压

    f32 fBatShuntCurrentBackup;         //电池分流器备份电流
    f32 fAdjustBatShuntCurrentBackup;   //电池分流器备份校准电流


    f32 fHallVolt;  //霍尔电压
    f32 fAdjustZeroHallVolt; //霍尔校零后电压
    f32 fAdjustHallVolt; //霍尔校零与双点校准后电压
    f32 fHallCurrent;  //霍尔电流
    f32 fAdjustHallCurrent;  //霍尔校准电流
    f32 fHall5Volt;    //霍尔5v供电电压
    f32 fVcc5Volt;   

    f32 fHvP5Volt;
    f32 fHvN5Volt;

    f32 fLinkVolt; //接触器外端电压
    f32 fAdjustLinkVolt; //接触器外端校准电压

    f32 fLinkShuntVolt;//接触器外端分流器电压
    f32 fAdjustLinkShuntVolt;//接触器外端分流器校准后电压

    f32 fLinkShuntCurrent;//接触器外端分流器电流
    f32 fAdjustLinkShuntCurrent;//接触器外端分流器电流

    f32 fNpeVolt;   //pe电压

    f32 fPeGndVolt;
    f32 fAdjustPeGndVolt; //pe校准电压
}SystemData_TypeDef;

enum
{
	BatVolt = 0,
	LinkVolt = 1,
	Hall5vSamp = 2,
    HallSignalSamp = 3,
    HallCurrentL = 4,
    HallCurrentH = 5,
    BatShuntCurrentL = 6,
    BatShuntCurrentH = 7,
    ShuntTemp = 8,
    Ka84917P5V = 9,
    Ka84917N5V = 10,
    BatPeResistance = 11,
    GndPeResistance = 12,
    NtcTemp1 = 13,  
    NtcTemp2 = 14,
    DidoGpioState = 15,
    Vdd5VSamp = 16,
    LinkShuntCurrentL = 17,
    LinkShuntCurrentH = 18,
    PeGndVolt = 19,
    SystemData_Len = 20,//采样信息长度
};


enum
{
    Di1 = 0,
    Do1 = 1,
    Do2 = 2,
    Sw1 = 3,
    Sw2 = 4,
    Sw3 = 5,
    Sw4 = 6,
    RunLed = 7,
    Almled = 8,
    DaisyComFail = 9,
    HallFailSignal = 10,
    PeRlyState = 11,
    ImdRlyState = 12,
    Ver1 = 13,
    Ver2 = 14,
};
extern SystemData_TypeDef gSystemData;//系统信息
extern s16 SystemData_51[SystemData_Len];//通信传输数据
/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/

/*=============================================================================================
** @Name      : void InPutSystemDataArray (u8 index ,s16 data);
** @Input     : index:系统数据下标 data:数据
** @Output    : void
** @Function  : 输入系统数据
** @The notes :
**===========================================================================================*/
void InPutSystemDataArray (u8 index ,s16 data);

/*=============================================================================================
** @Name      : s16 GetSystemDataArray (u8 index);
** @Input     : index:系统数据下标
** @Output    : 系统数据
** @Function  : 获取系统数据
** @The notes :
**===========================================================================================*/
s16 GetSystemDataArray (u8 index);

/*=============================================================================================
** @Name      : void InPutDiState(u8 state)
** @Input     : state:DI状态输入
** @Output    : void
** @Function  : DI状态输入
** @The notes : 
**===========================================================================================*/
void InPutDiState(u8 state);

/*=============================================================================================
** @Name      : u8 GetSwAddr(void)
** @Input     : void
** @Output    : 获取拨码地址
** @Function  : 
** @The notes : 
**===========================================================================================*/
u8 GetSwAddr(void);
/*=============================================================================================
** @Name      : void InPutDoState(u8 channel, u8 data)
** @Input     : channel:do通道 data:do状态
** @Output    : void
** @Function  : do状态输入
** @The notes : 
**===========================================================================================*/
void InPutDoState(u8 channel, u8 data);

/*=============================================================================================
** @Name      : void InPutSwAddr(u8 data)
** @Input     : data:拨码地址
** @Output    : void
** @Function  : 拨码地址输入
** @The notes : 
**===========================================================================================*/
void InPutSwAddr(u8 data);

/*=============================================================================================
** @Name      : void InPutNtcTemp(u8 channel, f32 data)
** @Input     : channel:ntc通道 data:温度数据
** @Output    : void
** @Function  : ntc温度数据输入
** @The notes : 
**===========================================================================================*/
void InPutNtcTemp(u8 channel, f32 data);

/*=============================================================================================
** @Name      : void InPutBatShuntTemp(f32 data)
** @Input     : data:温度数据
** @Output    : void
** @Function  : 电池端分流器温度数据输入
** @The notes : 
**===========================================================================================*/
void InPutBatShuntTemp(f32 data);

/*=============================================================================================
** @Name      : void InPutBatShuntVolt(f32 data)
** @Input     : data:电池端分流器电压数据
** @Output    : void
** @Function  : 电池端分流器电压数据
** @The notes : 
**===========================================================================================*/
void InPutBatShuntVolt(f32 data);
/*=============================================================================================
** @Name      : f32 GetBatShuntVolt(void)
** @Input     : void
** @Output    : 输出电池端分流器电压数据
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetBatShuntVolt(void);

/*=============================================================================================
** @Name      : void InPutfAdjustBatShuntVolt(f32 data)
** @Input     : data:电池端分流器校准后电压数据
** @Output    : void
** @Function  : 电池端分流器校准后电压数据
** @The notes : 校准后
**===========================================================================================*/
void InPutfAdjustBatShuntVolt(f32 data);
/*=============================================================================================
** @Name      : f32 GetfAdjustBatShuntVolt(void)
** @Input     : void
** @Output    : 
** @Function  : 电池端分流器校准后电压数据
** @The notes : 校准后
**===========================================================================================*/
f32 GetfAdjustBatShuntVolt(void);



/*=============================================================================================
** @Name      : void InPutBatShuntCurrent(f32 data)
** @Input     : data:电池端分流器电流数据
** @Output    : void
** @Function  : 电池端分流器电流数据
** @The notes : 
**===========================================================================================*/
void InPutBatShuntCurrent(f32 data);

/*=============================================================================================
** @Name      : f32 GetBatShuntCurrent(void)
** @Input     : void
** @Output    : data:电池端分流器电流数据
** @Function  : 返回电池端分流器电流数据
** @The notes : 
**===========================================================================================*/
f32 GetBatShuntCurrent(void);
/*=============================================================================================
** @Name      : void InPutfAdjustBatShuntCurrent(f32 data)
** @Input     : 电池端分流器校准后电流数据
** @Output    : void
** @Function  : 
** @The notes : 校准后
**===========================================================================================*/
void InPutfAdjustBatShuntCurrent(f32 data);

/*=============================================================================================
** @Name      : f32 GetfAdjustBatShuntCurrent(void)
** @Input     : void
** @Output    : 返回电池端分流器校准后电流数据
** @Function  : 
** @The notes : 校准后
**===========================================================================================*/
f32 GetfAdjustBatShuntCurrent(void);

/*=============================================================================================
** @Name      : void InPutfBatShuntVoltBackup(f32 data)
** @Input     : data:电池端分流器电压数据(备份)
** @Output    : void
** @Function  : 电池端分流器电压数据（备份）
** @The notes : 
**===========================================================================================*/
void InPutfBatShuntVoltBackup(f32 data);
/*=============================================================================================
** @Name      : f32 GetfBatShuntVoltBackup(void)
** @Input     : void
** @Output    : 返回电池端分流器校准后电流数据(备份)
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetfBatShuntVoltBackup(void);

/*=============================================================================================
** @Name      : void InPutfAdjustBatShuntVoltBackup(f32 data)
** @Input     : data:电池端分流器校准后电压数据(备份)
** @Output    : void
** @Function  : 电池端分流器校准后电压数据（备份）
** @The notes : 校准后
**===========================================================================================*/
void InPutfAdjustBatShuntVoltBackup(f32 data);

/*=============================================================================================
** @Name      : f32 GetfAdjustBatShuntVoltBackup(void)
** @Input     : void
** @Output    : 返回电池端分流器校准后电压数据（备份）
** @Function  : 
** @The notes : 校准后
**===========================================================================================*/
f32 GetfAdjustBatShuntVoltBackup(void);


/*=============================================================================================
** @Name      : void InPutfBatShuntCurrentBackup(f32 data)
** @Input     : data:电池端分流器电流数据(备份)
** @Output    : void
** @Function  : 电池端分流器电流数据（备份）
** @The notes : 
**===========================================================================================*/
void InPutfBatShuntCurrentBackup(f32 data);

/*=============================================================================================
** @Name      : f32 GetfBatShuntCurrentBackup(void)
** @Input     : void
** @Output    : 返回电池端分流器电流数据（备份）
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetfBatShuntCurrentBackup(void);

/*=============================================================================================
** @Name      : void InPutfAdjustBatShuntCurrentBackup(f32 data)
** @Input     : 电池端分流器校准后电流数据（备份）
** @Output    : void
** @Function  : 
** @The notes : 校准后
**===========================================================================================*/
void InPutfAdjustBatShuntCurrentBackup(f32 data);

/*=============================================================================================
** @Name      : f32 GetfAdjustBatShuntCurrentBackup(void)
** @Input     : void
** @Output    : 返回电池端分流器校准后电流数据（备份）
** @Function  : 
** @The notes : 校准后
**===========================================================================================*/
f32 GetfAdjustBatShuntCurrentBackup(void);

/*=============================================================================================
** @Name      : void InPutHallVolt(f32 data)
** @Input     : data:霍尔电压数据
** @Output    : void
** @Function  : 霍尔电压数据输入
** @The notes : 
**===========================================================================================*/
void InPutHallVolt(f32 data);

/*=============================================================================================
** @Name      : f32 GetHallVolt(void)
** @Input     : void
** @Output    : 输出霍尔电压数据
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetHallVolt(void);

/*=============================================================================================
** @Name      : void InPutfAdjustZeroHallVolt(f32 data)
** @Input     : 霍尔校零电压数据
** @Output    : void
** @Function  : 
** @The notes : 
**===========================================================================================*/
void InPutfAdjustZeroHallVolt(f32 data);

/*=============================================================================================
** @Name      : f32 GetfAdjustZeroHallVolt(void)
** @Input     : void
** @Output    : 输出霍尔校零电压数据
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetfAdjustZeroHallVolt(void);

/*=============================================================================================
** @Name      : void InPutfAdjustHallVolt(f32 data)
** @Input     : 霍尔校准后电压
** @Output    : void
** @Function  : 
** @The notes : 
**===========================================================================================*/
void InPutfAdjustHallVolt(f32 data);

/*=============================================================================================
** @Name      : f32 GetfAdjustHallVolt(void)
** @Input     : void
** @Output    : 霍尔校准后电压
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetfAdjustHallVolt(void);

/*=============================================================================================
** @Name      : void InPutHallCurrent(f32 data)
** @Input     : data:霍尔电流数据
** @Output    : void
** @Function  : 霍尔电流数据输入
** @The notes : 
**===========================================================================================*/
void InPutHallCurrent(f32 data);
/*=============================================================================================
** @Name      : f32 GetHallCurrent(void)
** @Input     : void
** @Output    : 输出霍尔电流数据
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetHallCurrent(void);

/*=============================================================================================
** @Name      : void InPutfAdjustHallCurrent(f32 data)
** @Input     : 霍尔校准后电流数据
** @Output    : void
** @Function  : 
** @The notes : 
**===========================================================================================*/
void InPutfAdjustHallCurrent(f32 data);

/*=============================================================================================
** @Name      : f32 GetfAdjustHallCurrent(void)
** @Input     : void
** @Output    : 输出霍尔校准后电流数据
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetfAdjustHallCurrent(void);

/*=============================================================================================
** @Name      : void InPutHall5Volt(f32 data)
** @Input     : data:霍尔5v供电电压数据
** @Output    : void
** @Function  : 霍尔5v供电电压数据输入
** @The notes : 
**===========================================================================================*/
void InPutHall5Volt(f32 data);

/*=============================================================================================
** @Name      : void InPutVcc5Volt(f32 data)
** @Input     : data:vcc供电电压数据
** @Output    : void
** @Function  : vcc供电电压数据输入
** @The notes : 
**===========================================================================================*/
void InPutVcc5Volt(f32 data);
/*=============================================================================================
** @Name      : void InPutHvP5Volt(f32 data)
** @Input     : data:高压侧分流器正5v电压数据
** @Output    : void
** @Function  : 高压侧分流器正5v电压数据输入
** @The notes : 
**===========================================================================================*/
void InPutHvP5Volt(f32 data);

/*=============================================================================================
** @Name      : void InPutHvN5Volt(f32 data)
** @Input     : data:高压侧分流器负5v电压数据
** @Output    : void
** @Function  : 高压侧分流器负5v电压数据输入
** @The notes : 
**===========================================================================================*/
void InPutHvN5Volt(f32 data);

/*=============================================================================================
** @Name      : void InPutBatVolt(f32 data)
** @Input     : data:电压数据
** @Output    : void
** @Function  : 电池电压数据
** @The notes : 
**===========================================================================================*/
void InPutBatVolt(f32 data);
/*=============================================================================================
** @Name      : f32 GetBatVolt(void)
** @Input     : void
** @Output    : 获取电池电压数据
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetBatVolt(void);
/*=============================================================================================
** @Name      : void InPutfAdjustBatVolt(f32 data)
** @Input     : 获取校准后电池电压数据
** @Output    : void
** @Function  : 
** @The notes : 
**===========================================================================================*/
void InPutfAdjustBatVolt(f32 data);

/*=============================================================================================
** @Name      : f32 GetfAdjustBatVolt(void)
** @Input     : void
** @Output    : 校准后电池电压数据
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetfAdjustBatVolt(void);

/*=============================================================================================
** @Name      : void InPutLinkVolt(f32 data)
** @Input     : data:接触器外端电压数据
** @Output    : void
** @Function  : 接触器外端电压数据
** @The notes : 
**===========================================================================================*/
void InPutLinkVolt(f32 data);
/*=============================================================================================
** @Name      : f32 GetLinkVolt(void)
** @Input     : void
** @Output    : 获取Link电压数据
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetLinkVolt(void);

/*=============================================================================================
** @Name      : void InPutfAdjustLinkVolt(f32 data)
** @Input     :
** @Output    : void
** @Function  : 
** @The notes : 
**===========================================================================================*/
void InPutfAdjustLinkVolt(f32 data);

/*=============================================================================================
** @Name      : f32 GetfAdjustLinkVolt(void)
** @Input     : void
** @Output    : 
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetfAdjustLinkVolt(void);

/*=============================================================================================
** @Name      : void InPutLinkShuntVolt(f32 data)
** @Input     : data:负载端分流器电压数据
** @Output    : void
** @Function  : 负载端分流器电压数据
** @The notes : 
**===========================================================================================*/
void InPutLinkShuntVolt(f32 data);
/*=============================================================================================
** @Name      : f32 GetLinkShuntVolt(void)
** @Input     : void
** @Output    : 输出负载端分流器电压数据
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetLinkShuntVolt(void);

/*=============================================================================================
** @Name      :void InPutfAdjustLinkShuntVolt(f32 data)
** @Input     : 校准后接触器外端分流器电流数据
** @Output    : void
** @Function  : 
** @The notes : 
**===========================================================================================*/
void InPutfAdjustLinkShuntVolt(f32 data);

/*=============================================================================================
** @Name      : f32 GetfAdjustLinkShuntVolt(void)
** @Input     : void
** @Output    : 
** @Function  : 返回校准后接触器外端分流器电流数据
** @The notes : 
**===========================================================================================*/
f32 GetfAdjustLinkShuntVolt(void);
/*=============================================================================================
** @Name      : void InPutBShuntCurrent(f32 data)
** @Input     : data:接触器外端分流器电流数据
** @Output    : void
** @Function  : 接触器外端分流器电流数据
** @The notes : 
**===========================================================================================*/
void InPutLinkShuntCurrent(f32 data);

/*=============================================================================================
** @Name      : f32 GetLinkShuntCurrent(void)
** @Input     : void 
** @Output    : data:接触器外端分流器电流数据
** @Function  : 返回接触器外端分流器电流数据
** @The notes : 
**===========================================================================================*/
f32 GetLinkShuntCurrent(void);

/*=============================================================================================
** @Name      : void InPutfAdjustLinkShuntCurrent(f32 data)
** @Input     : 校准后接触器外端分流器电流数据
** @Output    : void
** @Function  : 
** @The notes : 
**===========================================================================================*/
void InPutfAdjustLinkShuntCurrent(f32 data);

/*=============================================================================================
** @Name      : f32 GetfAdjustLinkShuntCurrent(void)
** @Input     : void
** @Output    : 
** @Function  : 返回校准后接触器外端分流器电流数据
** @The notes : 
**===========================================================================================*/
f32 GetfAdjustLinkShuntCurrent(void);


/*=============================================================================================
** @Name      : void InPutNpeVolt(f32 data)
** @Input     : data:npe采样电压数据
** @Output    : void
** @Function  : npe采样电压数据输入
** @The notes : 
**===========================================================================================*/
void InPutNpeVolt(f32 data);
/*=============================================================================================
** @Name      : void InPutPeGndVolt(f32 data)
** @Input     : data:pe对负极电压数据
** @Output    : void
** @Function  : pe对负极电压数据
** @The notes : 
**===========================================================================================*/
void InPutPeGndVolt(f32 data);
/*=============================================================================================
** @Name      : f32 GetPeGndVolt(void)
** @Input     : void
** @Output    : 输出pe对负极电压数据
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetPeGndVolt(void);
/*=============================================================================================
** @Name      : void InPutfAdjustPeGndVolt(f32 data)
** @Input     : 输出校准后pe对负极电压数据
** @Output    : void
** @Function  : 
** @The notes : 
**===========================================================================================*/
void InPutfAdjustPeGndVolt(f32 data);

/*=============================================================================================
** @Name      : f32 GetfAdjustPeGndVolt(void)
** @Input     : void
** @Output    : 校准后pe对负极电压数据
** @Function  : 
** @The notes : 
**===========================================================================================*/
f32 GetfAdjustPeGndVolt(void);



#endif      