/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : BSPTIM.c
** @Founder      : WYC834
** @Date         : 2025.10.11
** @Function     : Timer定时器驱动函数模块
** @Instructions :
**===========================================================================================*/
#ifndef _BSPFTM_H
#define _BSPFTM_H

/*=============================================================================================
** @Header file definition
**===========================================================================================*/
#include "BSPTypeDef.h"

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define RunTimersOverflow 0x80000000
/*=============================================================================================
** @Data type definition
**===========================================================================================*/
typedef enum
{
    eTIM6 = 0,       
    eTIM7 = 1,       
    eTIMNUM,
}e_TIMNum;
typedef enum
{
    tim_ch1 = 0,
    tim_ch2,
    tim_ch3,
    tim_ch4,
    tim_ch5,
    tim_ch6,
    tim_ch7,
} TIM_CHn;

typedef enum
{        
    ePWM_CH_1 = 0,           
    ePWM_CH_2,              
    ePWM_CH_3,              
    ePWM_CH_4, 
    ePWM_CHNUM
}e_PWM_CHNum;
/*=============================================================================================
** @Interface function declaration
**===========================================================================================*/

/*=============================================================================================
** @Name      : u8 BSPTIMInit(e_FTMNum chanel)
** @Input     : chanel:FTMx通道号 
** @Output    : 初始化结果 TRUE:成功 FALSE:失败
** @Function  : PIT驱动模块初始化
** @The notes : BSP调用
**===========================================================================================*/
u8 BSPTIMInit(e_TIMNum chanel);

// void delay_us_tim(u32 nus);
u32 GetRunTimers(void);
#endif

